import {Footer, Header, Section, TextOnlySection} from "../../containers";
import {Navbar, EventTimeline, FAQ, StaffCarousel} from "../";

function shuffle(array: number[]) {
    let currentIndex = array.length, randomIndex;
    while (currentIndex > 0) {
        randomIndex = Math.floor(Math.random() * currentIndex);
        currentIndex--;
        [array[currentIndex], array[randomIndex]] = [
            array[randomIndex], array[currentIndex]];
    }
    return array;
}

const crocs = shuffle([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]);

const timeline = [
    {
        date: "22 Mehr",
        title: "Registeration Starts.",
        description: "ثبت‌نام انفرادی در سایت شروع می‌شود. تیم‌بندی برای مسابقه در روزهای آتی انجام خواهد شد."
    },
    {
        date: "26 Mehr - 2 Aban",
        title: "Algorithmic Workshops",
        description: "??????"
    },
    {
        date: "4 Aban",
        title: "Selection Contest",
        description: "مسابقه انتخابی به صورت مجازی در روز ۴ آبان برگزار می‌شود و تیم‌های راه یافته به مرحله نهایی حضوری از نتیجه این مسابقه انتخاب می‌شود."
    },
    {
        date: "2 Azar",
        title: "Final Contest",
        description: "مسابقات نهایی رویداد در یک روز به صورت حضوری در دانشگاه شریف برگزار می‌شود. جوایز و رتبه‌های نهایی پس از این رقابت مشخص خواهد شد."
    },
];

const staff = [
    {
        name: "Ali Shahali",
        title: "Head of Event",
        image: "assets/staff/shahali.jpg",
    },
    {
        name: "Ali Salesi",
        title: "Head of Technical",
        image: "assets/staff/salesi.jpg",
    },
    {
        name: "Emad Emam Jome",
        title: "Head of Social",
        image: "assets/staff/emamjome.jpg",
    },
];

const faq = [
    {
        question: "سطح بندی مسابقه به چه صورت است؟",
        answer:
            "مسابقه در 3 سطح Junior(مناسب دانش‌آموزانی که مدال المپیاد کامپیوتر ندارند)، Senior(مناسب دانشجوهایی که مدال المپیاد کامپیوتر یا ICPC ندارند) و Pro(مناسب دارندگان مدال المپیاد کامپیوتر یا ICPC) برگزار می‌شود. هر تیم دو نفره در سطح نفر بالاتر گروه شرکت خواهد کرد. به عنوان مثال تیمی با یک عضو Pro و یک عضو Junior، در رده Pro رقابت خواهد کرد.",
    },
    {
        question: "دانشجوهای چه رشته‌هایی امکان شرکت در مسابقه را دارند؟",
        answer:
            "به طور کلی این مسابقه مناسب دانشجویان رشته‌های مهندسی‌کامپیوتر، علوم‌کامپیوتر، مهندسی برق و علوم ریاضی است، اما تمامی دانشجویانی که درس مبانی‌ برنامه‌نویسی را پاس کرده‌اند و به حوزه الگوریتم علاقه دارند، می‌توانند در این مسابقه شرکت کنند.",
    },
    {
        question:
            "از چه زبان‌های برنامه‌نویسی برای شرکت در مسابقه می‌توان استفاده کرد؟",
        answer:
            "سیستم داوری مسابقه از زبان‌های C, C++ , Java , Python پشتیبانی می‌کند.",
    },
    {
        question: "قبل از مسابقه، کارگاه آموزشی برگزار می‌شود؟",
        answer:
            "بله، پیش از برگزاری مسابقه کارگاه‌های ضبط‌شده‌ای در اختیار شرکت‌کنندگان قرار می‌گیرد که تعدادی مسئله هم برای تمرین بیشتر شرکت‌کنندگان دارد.",
    },
    {
        question: "مسابقه به صورت مجازی برگزار می‌شود یا حضوری؟",
        answer:
            "مرحله اول مسابقه به صورت مجازی و مرحله دوم به صورت حضوری در دانشگاه صنعتی شریف برگزار می‌شود.",
    },
    {
        question: "مسابقه به صورت گروهی برگزار می‌شود یا فردی؟",
        answer:
            "مسابقه به صورت گروهی و در گروه‌های 2 نفره برگزار می‌شود. شرکت در مسابقه فقط به صورت تیمی میسر است.",
    },
    {
        question: "در صورت نداشتن هم‌تیمی چه‌طور می‌توانم هم‌تیمی پیدا کنم؟",
        answer:
            "پیش از برگزاری مسابقه گروهی تلگرامی برای شرکت‌کنندگان تشکیل می‌شود. شما می‌توانید در آن گروه برای خود هم‌تیمی پیدا کنید.",
    },
    {
        question:
            "من دانش‌آموز هستم و تجربه برنامه‌نویسی دارم، اما المپیاد کامپیوتری نیستم. آیا امکان شرکت در مسابقه را دارم؟",
        answer:
            "بله، مسابقه در سه سطح برگزار می‌شود و شما می‌توانید در سطح دانش‌آموزی مسابقه شرکت کنید.",
    },
    {
        question: "برای شرکت در مسابقه چه هزینه‌ای باید پرداخت کنم؟",
        answer:
            "شرکت در مسابقه‌ی انتخابی که آنلاین برگزار می‌شود برای همه رایگان است. اما برای تیم‌های راه یافته به مرحله حضوری، مبلغی برای ثبت‌نام در نظر گرفته شده است.",
    },
    {
        question: "چه جایزه‌ای به تیم‌های برتر تعلق می‌گیرد؟",
        answer: "به تیم‌های برتر مسابقه حضوری، جوایز نقدی تعلق می‌گیرد.",
    }
];

function Landing() {
    return (
        <>
            <Navbar/>
            <Header/>
            <Section name="introduction" side="right" dino={crocs[0]}>
                <TextOnlySection
                    text="مسابقه آموزشی کدوکدیل، رقابتی جذاب و فرصت‌ساز برای دانشجویان و دانش‌آموزان علاقه‌مند به علوم کامپیوتر و برنامه‌نویسی است. این مسابقه در سه سطح Senior ،Junior و Pro برگزار می‌شود. دانشجویان رشته‌های مهندسی کامپیوتر، علوم کامپیوتر، مهندسی برق، علوم ریاضی و همچنین تمامی دانشجویانی که درس مبانی برنامه‌نویسی را گذرانده‌اند و به حوزه الگوریتم علاقه‌مند هستند، امکان شرکت در این مسابقه را دارند. در این رقابت، زبان‌های برنامه‌نویسی C، C++، Java و Python توسط سیستم داوری پشتیبانی می‌شوند. پیش از آغاز مسابقه، کارگاه‌های آموزشی برگزار می‌شود تا شرکت‌کنندگان بتوانند مهارت‌های خود را در زمینه الگوریتم  تقویت کنند. مرحله اول مسابقه به صورت مجازی و مرحله دوم به صورت حضوری در دانشگاه صنعتی شریف برگزار می‌شود. شرکت در این مسابقه تنها به‌صورت تیم‌های دو نفره ممکن است. در صورتی که هم‌تیمی ندارید، می‌توانید از طریق گروه تلگرامی مخصوص شرکت‌کنندگان، هم‌تیمی مناسب خود را پیدا کنید. شرکت در مرحله انتخابی آنلاین رایگان است و تیم‌های برتر مسابقه حضوری علاوه بر جوایز نقدی، هدایایی نیز دریافت خواهند کرد."
            />
            </Section>
            <a href={"/sponsor"}>
                <Section nameColor={"#FF5B35"} name="Tapsi ~ Sponsor of Event" side="left" dino={crocs[2]}
                         image={"assets/tapsi-logo-fa.png"}>
                    <TextOnlySection
                        text="لوگوی جدید تپسی برای دستیابی به این هدف از فناوری‌های روز دنیا بهره می‌گیرد تا خواسته‌ها و نیازهای کاربران خود را برآورده کند. برای رسیدن به این هدف، داشتن و تداوم تیمی درجه یک، نیازی محوری است به همین دلیل شکل‌دهی و تأمین تیمی حرفه‌ای و اهل رقابت یکی از محورهای اصلی مأموریت ماست. فونت دانا بیشتر از هر چیز نشان‌دهنده فرهنگ نوشتار ایرانی در دوران مدرن است. شکل حروف در فونت دانا با هندسه دقیقی طراحی شده که هماهنگی مناسبی با جنس گرافیک دیجیتال در محیط نرم‌افزاری دارد. این شیوه طراحی همچنین باعث سادگی شکل حروف شده‌است که با هدف اصلی طراحی رابط‌های کاربری که همان ارتباط سریع و آسان باشد همسو است. مطمئنا تجربه خواندن نوشته‌ در محیط موبایل و نرم‌افزار باید با خواندن کتاب و مطبوعات چاپی متفاوت باشد. این تجربه متفاوت را فونت دانا ایجاد می‌کند."
                    />
                </Section>
            </a>
            <Section name="timeline" side="left" dino={crocs[1]}>
                <EventTimeline events={timeline}/>
            </Section>
            {<Section name="staff">
                <StaffCarousel staff={staff}/>
            </Section>}
            <Section name="FAQ" capitalize={true} side="right" dino={crocs[3]}>
                <FAQ data={faq}/>
            </Section>
            <Footer year={"2024"}/>
        </>
    );
}

export default Landing;
